In [66]:
# future notes:
   # I can add a field where they enter a user code and if it is valid they can use the service
    #this will avoid user information needs

# Core Problem
### Identify duplicate or matching individuals across CSVs with messy data

In [119]:
import pandas as pd
from rapidfuzz import fuzz
import string

df_g = pd.read_csv("general")
df_p = pd.read_csv("political")

In [120]:
# Below is Data prep
for col in df_p.columns:            #looping through col
    for i in range(len(df_p[col])):  #Loop through each row in that col
        value = df_p.at[i,col]       # get the value
        if isinstance(value,str):    #check if its a string
            df_p.at[i,col] = value.lower().strip()  #make it lower and remoces white space


for col in df_g.columns:            #looping through col
    for i in range(len(df_g[col])):  #Loop through each row in that col
        value = df_g.at[i,col]       # get the value
        if isinstance(value,str):    #check if its a string
            df_g.at[i,col] = value.lower().strip() #make it lower and removes white space

In [121]:
#creating a index column so when we do union we can see original location
def index_og1(df):
    df['og_loc'] = df.index
    return df

def index_og2(df):
    df = df.copy()
    letters = list(string.ascii_uppercase)
    df["og_loc"] = letters[:len(df)]  # add as a new column
    return df

df_p = index_og1(df_p)
df_g = index_og2(df_g)

In [122]:
#have to add a part on how to handle nulls ? might not need to have to think about it

In [123]:
#Here have to add a part where they tell us what columns to select and we pull those columns
#no need to pull all the data since we will just refer to them by their 'og_loc' number

col_to_use1 =[]
continue1 = True

while continue1:
    value = input("What col would you like to match on. One at a time then press enter").strip()
    if value:
        col_to_use1.append(value) #prevents blanks from being added in
    value2 = input("Any more? Y or N").upper().strip()
    if value2 == 'N':
        continue1 = False
#For the example we will use ['fname', 'lname', 'dob', 'state']

What col would you like to match on. One at a time then press enter fname
Any more? Y or N y
What col would you like to match on. One at a time then press enter lname
Any more? Y or N y
What col would you like to match on. One at a time then press enter dob
Any more? Y or N y
What col would you like to match on. One at a time then press enter state
Any more? Y or N n

In [124]:
compr_df = pd.concat([df_g[['fname','lname','dob','state','og_loc']],df_p[['fname','lname','dob','state','og_loc']]], axis =0)

In [125]:
compr_df['combo_code1'] = ''  # start with empty strings
compr_df['combo_code2'] = ''  # start with empty strings
compr_df['combo_code3'] = ''  # start with empty strings

for col in col_to_use1:
    compr_df['combo_code1'] += compr_df[col].str[:3].fillna('')
    
for col in col_to_use1:
    compr_df['combo_code2'] += compr_df[col].str[:4].fillna('')

for col in col_to_use1:
    compr_df['combo_code3'] += compr_df[col].str[:5].fillna('')

In [126]:
compr_df.head(5)

,fname,lname,dob,state,og_loc,combo_code1,combo_code2,combo_code3
0,john,smith,1985-04-12,il,A,johsmi198il,johnsmit1985il,johnsmith1985-il
1,elizabeth,jones,1990-07-23,ma,B,elijon199ma,elizjone1990ma,elizajones1990-ma
2,mike,johnson,1982-11-01,tx,C,mikjoh198tx,mikejohn1982tx,mikejohns1982-tx
3,sarah,williams,1995-02-19,co,D,sarwil199co,sarawill1995co,sarahwilli1995-co
4,robert,brown,1978-09-03,wa,E,robbro197wa,robebrow1978wa,roberbrown1978-wa

In [127]:
compr_df['dup_flag1'] = compr_df['combo_code1'].duplicated(keep=False).astype(int)
compr_df['dup_flag2'] = compr_df['combo_code2'].duplicated(keep=False).astype(int)
compr_df['dup_flag3'] = compr_df['combo_code3'].duplicated(keep=False).astype(int)

In [128]:
compr_df = compr_df.sort_values(by=['dup_flag3','dup_flag2','dup_flag1'], ascending = False)

In [129]:
compr_df.head(2)

,fname,lname,dob,state,og_loc,combo_code1,combo_code2,combo_code3,dup_flag1,dup_flag2,dup_flag3
4,robert,brown,1978-09-03,wa,E,robbro197wa,robebrow1978wa,roberbrown1978-wa,1,1,1
5,emily,davis,1989-12-25,or,F,emidav198or,emildavi1989or,emilydavis1989-or,1,1,1

In [130]:
def get_score(row):
    if row['dup_flag1']:
        if row['dup_flag2']:
            if row['dup_flag3']:
                return 100
            return 66
        return 33
    return 0

compr_df['score'] = compr_df.apply(get_score, axis = 1)

In [131]:
# Commenting this out since we may need the combo_codes to create additional fuzzy scores
# compr_df.drop(columns = ['dup_flag1','dup_flag2','dup_flag3', 'combo_code1','combo_code2','combo_code3'],inplace=True)

In [132]:

combo_code3 = compr_df[compr_df['score'] == 100]
combo_code3 = pd.merge(combo_code3,combo_code3, on = 'combo_code3', how = 'inner')
combo_code3 = combo_code3[['fname_x','lname_x','dob_x','og_loc_x','fname_y','lname_y','dob_y','og_loc_y']]



combo_code3 = combo_code3[
    combo_code3["og_loc_x"].astype(str).str.isnumeric() &
    combo_code3["og_loc_y"].astype(str).str.isalpha()
]



combo_code2 = compr_df[compr_df['score'] == 66]
combo_code2 = pd.merge(combo_code2,combo_code2, on = 'combo_code2', how = 'inner')
combo_code2 = combo_code3[['fname_x','lname_x','dob_x','og_loc_x','fname_y','lname_y','dob_y','og_loc_y']]



combo_code2 = combo_code2[
    combo_code2["og_loc_x"].astype(str).str.isnumeric() &
    combo_code2["og_loc_y"].astype(str).str.isalpha()
]



combo_code1 = compr_df[compr_df['score'] == 100]
combo_code1 = pd.merge(combo_code1,combo_code1, on = 'combo_code1', how = 'inner')
combo_code1 = combo_code1[['fname_x','lname_x','dob_x','og_loc_x','fname_y','lname_y','dob_y','og_loc_y']]



combo_code1 = combo_code1[
    combo_code1["og_loc_x"].astype(str).str.isnumeric() &
    combo_code1["og_loc_y"].astype(str).str.isalpha()
]

In [133]:
combo_code3['fuzzy_fname'] = combo_code3.apply(
    lambda x: fuzz.partial_ratio(str(x['fname_x']), str(x['fname_y'])),
    axis=1
)

combo_code2['fuzzy_fname'] = combo_code2.apply(
    lambda x: fuzz.partial_ratio(str(x['fname_x']), str(x['fname_y'])),
    axis=1
)

combo_code1['fuzzy_fname'] = combo_code1.apply(
    lambda x: fuzz.partial_ratio(str(x['fname_x']), str(x['fname_y'])),
    axis=1
)

In [137]:
combo_code1

,fname_x,lname_x,dob_x,og_loc_x,fname_y,lname_y,dob_y,og_loc_y,fuzzy_fname
22,robert,brown,1978-09-03,4,robert,brown,1978-09-03,E,100.0
24,emily,davis,1989-12-25,5,emily,davis,1989-12-25,F,100.0
26,chris,miller,1992-06-30,6,chris,miller,1992-06-30,G,100.0
28,jessica,wilson,1986-01-14,7,jessica,wilson,1986-01-14,H,100.0
30,jake,anderson,1987-05-10,10,jake,anderson,1987-05-10,K,100.0
32,laura,thomas,1993-09-29,11,laura,thomas,1993-09-29,L,100.0
34,david,jackson,1980-10-05,12,david,jackson,1980-10-05,M,100.0
36,megan,white,1996-12-01,13,megan,white,1996-12-01,N,100.0
38,rachel,martin,1992-07-02,15,rachel,martin,1992-07-02,P,100.0
40,william,thompson,1975-02-20,16,william,thompson,1975-02-20,Q,100.0
42,hannah,lewis,1997-08-13,19,hannah,lewis,1997-08-13,T,100.0

In [ ]:
#############################################################################################################

In [14]:
compr_df = compr_df.sort_values(by = ['score'], ascending =[False])
compr_df = compr_df[['og_loc','fname','lname','dob','state','score']]

In [15]:
compr_df.head()

    og_loc   fname   lname         dob state  score
4        4  robert   brown  1978-09-03    wa    100
5        5   emily   davis  1989-12-25    or    100
19      19  hannah   lewis  1997-08-13    fl    100
5        5   emily   davis  1989-12-25    or    100
15      15  rachel  martin  1992-07-02    nv    100

In [ ]:
# Dummy code below

  
    # --- Fuzzy component ---
    fuzzy_name1 = fuzz.partial_ratio(row1['fname'], row2['fname'])
    
    fuzzy_lname = fuzz.partial_ratio(row1['lname'], row2['lname'])
    fuzzy_dob = fuzz.ratio(str(row1['dob']), str(row2['dob']))
    fuzzy_avg = (fuzzy_name + fuzzy_lname + fuzzy_dob) / 3

    # --- Combine them (weighted average) ---
    final_score = 0.6 * rule_score + 0.4 * fuzzy_avg
    return final_score

In [ ]:
def confidence_label(score):
    if score >= 85:
        return "High"
    elif score >= 70:
        return "Medium"
    else:
        return "Low"

# Rapi Fuzzy exp
- it works by using the Levenshtein distance (how many edits it takes to turn one string into another).
- Example:
-   "ismael" vs "ishmael" → 86%
-    "bob" vs "robert" → 40%
-    "123 main st" vs "123 main street" → 95%